publish/apuntes/matematicas-discretas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2021-09-03 vie 01:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Matemáticas Discretas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="../style.css" />
<link rel="shortcut icon" type="image/jpg" href="../favicon.png"/>
<meta name="theme-color" content="#fff">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no"/>
<div id="google_translate_element"></div></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Matemáticas Discretas
<br />
<span class="subtitle">Apuntes</span>
</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcfcde0b">1. Lenguaje formal</a></li>
<li><a href="#org857bb21">2. Lenguaje natural</a></li>
<li><a href="#org61a3322">3. Variables proposiciones</a></li>
<li><a href="#org70367ee">4. Conectivas proposicionales</a></li>
<li><a href="#orgf66ff62">5. Tautología</a></li>
<li><a href="#org52fed76">6. Contradicción</a></li>
<li><a href="#org88f92b4">7. Tablas de verdad</a></li>
<li><a href="#org6c99872">8. Equivalencia lógica</a></li>
<li><a href="#org5bfa5da">9. Leyes commutativas</a></li>
<li><a href="#orga5106a7">10. Leyes asociativas</a></li>
<li><a href="#org9fcc957">11. Leyes distributivas</a></li>
<li><a href="#org7a7e56b">12. Leyes de la identidad</a></li>
<li><a href="#org5f97f7c">13. Leyes de negacion</a></li>
<li><a href="#orgac0a353">14. Ley de la doble negacion</a></li>
<li><a href="#orge4980c2">15. Leyes de idempotencia</a></li>
<li><a href="#orgfd97f7a">16. Leyes universales acortadas</a></li>
<li><a href="#org9ab6331">17. Leyes de morgan</a></li>
<li><a href="#orgd5a97ce">18. Leyes de absorción</a></li>
<li><a href="#org35e54b0">19. Negaciones de <b>t</b> y <b>c</b></a></li>
<li><a href="#org3f5979d">20. Implicación</a></li>
<li><a href="#org4022081">21. Validación de argumentos (Demostración)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcfcde0b" class="outline-2">
<h2 id="orgcfcde0b"><span class="section-number-2">1</span> Lenguaje formal</h2>
<div class="outline-text-2" id="text-1">
<p>
El lenguaje formal es un lenguaje artificial, convencional, elegido de manera consciente y cuidadosa para expresarse precisa,
sistemática, rigurosa y unívocamente, por lo común dentro de
un cierto campo del saber y con determinados fines.
</p>
</div>
</div>

<div id="outline-container-org857bb21" class="outline-2">
<h2 id="org857bb21"><span class="section-number-2">2</span> Lenguaje natural</h2>
<div class="outline-text-2" id="text-2">
<p>
El lenguaje natural es aquel que utilizamos cotidianamente. Surge históricamente dentro de la sociedad y es aprendido sin que
exista necesariamente en el individuo un acto reflexivo.
</p>
</div>
</div>

<div id="outline-container-org61a3322" class="outline-2">
<h2 id="org61a3322"><span class="section-number-2">3</span> Variables proposiciones</h2>
<div class="outline-text-2" id="text-3">
<p>
conjunto de <span class="underline">enunciados declarativos</span> que formalizan la expresión, usualmente se les denota con las letras (p, q, r, s&#x2026;).
</p>

<dl class="org-dl">
<dt>Enunciado declarativo</dt><dd>es aquella proposición de lenguaje objeto de la caal podemos predicar su verdad o su falsedad.</dd>
</dl>

<div class="DEMONSTRATION">
<div class="org-center">
<p>
<i>"Hay un automóvil blanco en el aparcamento"</i>.
</p>
</div>

</div>

<dl class="org-dl">
<dt>Enunciado NO declarativo</dt><dd>es un enunciado que no puede ser convertido a lenguaje formal.</dd>
</dl>

<div class="DEMONSTRATION">
<div class="org-center">
<p>
<i>"¿Dónde esta mi automóvil?"</i>. <br />
<i>"¡Guarda silencio!"</i>. <br />
</p>
</div>

</div>

<dl class="org-dl">
<dt>Enunciado atómico</dt><dd>es aquél enunciado único, que en su expresión no incluye ningún conectivo lógico, es decir, no une dos o más enunciados.</dd>
</dl>

<div class="DEMONSTRATION">
<div class="org-center">
<p>
<i>"Hoy es miércoles."</i> <br />
<i>"Vivo en el distrito Federeal."</i> <br />
<i>"Pablo es matematico"</i> <br />
</p>
</div>

</div>

<p>
<a href="http://objetos.unam.mx/logica/formasLogicas/pdf/forma.logica.de.enunciados.pdf">Extraido</a> 
</p>
</div>
</div>

<div id="outline-container-org70367ee" class="outline-2">
<h2 id="org70367ee"><span class="section-number-2">4</span> Conectivas proposicionales</h2>
<div class="outline-text-2" id="text-4">
<p>
son los simbolos que formalizan los elementos del lenguaje que sirven para su funcion argumentativa.
</p>

<div class="DEMONSTRATION">
<div class="org-center">
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="1" align="center" mode="inline-math">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Relacion</th>
<th scope="col" class="org-left">Notación</th>
<th scope="col" class="org-left">Lectura</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Negacion</td>
<td class="org-left">\(\lnot\)</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">Conjunción</td>
<td class="org-left">\(\lor   \)</td>
<td class="org-left">o</td>
</tr>

<tr>
<td class="org-left">Disyunción</td>
<td class="org-left">\(\land\)</td>
<td class="org-left">y<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
</tr>

<tr>
<td class="org-left">Implicación</td>
<td class="org-left">\(\rightarrow\)</td>
<td class="org-left">entonces</td>
</tr>

<tr>
<td class="org-left">Equivalencia</td>
<td class="org-left">\(\equiv  \)</td>
<td class="org-left">equivalente a</td>
</tr>

<tr>
<td class="org-left">Por lo tanto</td>
<td class="org-left">\(\vdash\)</td>
<td class="org-left">deduce que, conclusion</td>
</tr>
</tbody>
</table>
</div>

</div>

<p>
<a href="https://en.wikipedia.org/wiki/List_of_logic_symbols">Lista de simbolos completa</a> <br />
</p>

<div class="DEMONSTRATION">
<div class="org-center">
<p>

</p>

<p>
p &equiv; "Hago ejercicio diariamente." <br />
q &equiv; "Me alimento sanamente." <br />
r &equiv; "Tengo buena salud." <br />
</p>

<p>
<i>"Hago ejercicio diariamente y me alimento sanamente"</i> <br />
</p>

<p>
\( p \land q \)
</p>

<p>
<i>"No tengo buena salud y no hago ejercicio  diariamente"</i> <br />
</p>

<p>
\( ¬r \land ¬p \)
</p>

<p>
<i>"Si me alimento sanamente y hago ejercicio diariamente, entonces tengo buena salud"</i> <br />
</p>

<p>
\( (p \land q) \implies r \)
</p>
</div>

</div>

<div class="DEMONSTRATION">
<div class="org-center">
<p>

</p>

<p>
p &equiv; "Viene Julia" <br />
q &equiv; "Viene María" <br />
r &equiv; "Viene Javier" <br />
</p>

<p>
<i>"Viene Julia, María y Javier"</i> <br />
</p>

<p>
\( p \land q \land r \)
</p>
</div>

</div>
</div>
</div>

<div id="outline-container-orgf66ff62" class="outline-2">
<h2 id="orgf66ff62"><span class="section-number-2">5</span> Tautología</h2>
<div class="outline-text-2" id="text-5">
<p>
es un forma de enunciado que siempre es verdadera, independientemente de los valores de verdad de los enunciados individuales sustituidos por sus enunciados variables. Un enunciado cuya forma es una tautología es un <b>enunciado tautológico</b>.
</p>
</div>
</div>

<div id="outline-container-org52fed76" class="outline-2">
<h2 id="org52fed76"><span class="section-number-2">6</span> Contradicción</h2>
<div class="outline-text-2" id="text-6">
<p>
es una forma de enunciado que siempre es falso, independientemente de los valors de verdad de los enunciados individuales de los enunciados sustituidos. Un enunciado cuya forma es una contradicción es un <b>enunciado contradictorio</b>.
</p>
</div>
</div>

<div id="outline-container-org88f92b4" class="outline-2">
<h2 id="org88f92b4"><span class="section-number-2">7</span> Tablas de verdad</h2>
<div class="outline-text-2" id="text-7">
<p>
Son tablas que nos sirven para conocer los valores de verdad de las proposiciones compuestas.
</p>

<div class="DEMONSTRATION">
<div class="org-center">
<p>

</p>

<p>
p &equiv; <i>"salió electo Presidente de la República"</i> <br />
q &equiv; <i>"el crecimiento anual fue del 7%"</i> <br />
</p>

<p>
<i>"No salió electo Presidente de la República o el crecimiento anual no fue del 7%"</i> <br />
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="1" align="center" mode="inline-math">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">p</th>
<th scope="col" class="org-left">q</th>
<th scope="col" class="org-left">¬p</th>
<th scope="col" class="org-left">¬q</th>
<th scope="col" class="org-left">p∧q</th>
<th scope="col" class="org-left">¬p∧q</th>
<th scope="col" class="org-left">p∧¬q</th>
<th scope="col" class="org-left">¬p∧¬q</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">V</td>
<td class="org-left">V</td>
<td class="org-left">F</td>
<td class="org-left">V</td>
<td class="org-left">V</td>
<td class="org-left">V</td>
</tr>
</tbody>
</table>
</div>

</div>



<p>
<a href="https://calculadorasonline.com/generador-de-tablas-de-verdad-logica-proposicional-algebra-booleana/">Generador de tablas de verdad</a> |
</p>
</div>
</div>

<div id="outline-container-org6c99872" class="outline-2">
<h2 id="org6c99872"><span class="section-number-2">8</span> Equivalencia lógica</h2>
<div class="outline-text-2" id="text-8">
<p>
Dos formas de enunciado se llaman lógicamente equivalents si y sólo si, tienen los mismos valores de verdad para cada posible sustitución de enunciados por sus enunciados de variables. La equivalencia lógica de las formas de enunciado P y Q se denota escribiendo P ≡ Q.
</p>
</div>
</div>

<div id="outline-container-org5bfa5da" class="outline-2">
<h2 id="org5bfa5da"><span class="section-number-2">9</span> Leyes commutativas</h2>
<div class="outline-text-2" id="text-9">
<p>
Establecen que el orden en el cual sume o multiplique dos números reales no afecta el resultado.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
 p \land q &\equiv q \land p &
 p \lor q &\equiv q \lor p
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-orga5106a7" class="outline-2">
<h2 id="orga5106a7"><span class="section-number-2">10</span> Leyes asociativas</h2>
<div class="outline-text-2" id="text-10">
<p>
Establecen que cuando suma o multiplica cualesquiera tres números reales, el grupo (o asociación) de los números no afecta el resultado.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
 (p \land q) \land r &\equiv p \land (q \land r) \\
 (p \lor q) \lor r &\equiv p \lor (q \lor r)
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-org9fcc957" class="outline-2">
<h2 id="org9fcc957"><span class="section-number-2">11</span> Leyes distributivas</h2>
<div class="outline-text-2" id="text-11">
<p>
Expresa que se obtiene la misma respuesta cuando multiplicas un conjunto de números por otro número que cuando se hace cada multiplicación por separado
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
 p \land (q \lor r) &\equiv (p \land q) \lor (p \land r) \\
 p \lor (q \land r) &\equiv (p \lor q) \land (p \lor r)
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-org7a7e56b" class="outline-2">
<h2 id="org7a7e56b"><span class="section-number-2">12</span> Leyes de la identidad</h2>
<div class="outline-text-2" id="text-12">
<p>
Es la constatación de que dos objetos que matemáticamente se escriben diferente, son de hecho el mismo objeto.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
 p \land t &\equiv p &
 p \lor c &\equiv p
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-org5f97f7c" class="outline-2">
<h2 id="org5f97f7c"><span class="section-number-2">13</span> Leyes de negacion</h2>
<div class="outline-text-2" id="text-13">
<p>
Dada una proposición p su contraria no p es verdadera.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
p \land \lnot p &\equiv t & p \lor \lnot p &\equiv c
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-orgac0a353" class="outline-2">
<h2 id="orgac0a353"><span class="section-number-2">14</span> Ley de la doble negacion</h2>
<div class="outline-text-2" id="text-14">
<p>
se produce cuando se combina el adverbio no con la presencia de otros elementos que tienen también sentido negativo.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
\lnot(\lnot p) \equiv p
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-orge4980c2" class="outline-2">
<h2 id="orge4980c2"><span class="section-number-2">15</span> Leyes de idempotencia</h2>
<div class="outline-text-2" id="text-15">
<p>
es la propiedad para realizar una acción determinada varias veces y aun así conseguir el mismo resultado que se obtendría si se realizase una sola vez.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
p \land p &\equiv p & p \lor p &\equiv p 
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-orgfd97f7a" class="outline-2">
<h2 id="orgfd97f7a"><span class="section-number-2">16</span> Leyes universales acortadas</h2>
<div class="outline-text-2" id="text-16">
<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
p \lor t &\equiv t & p \land c &\equiv c
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-org9ab6331" class="outline-2">
<h2 id="org9ab6331"><span class="section-number-2">17</span> Leyes de morgan</h2>
<div class="outline-text-2" id="text-17">
<p>
son un par de reglas de transformación que son ambas reglas de inferencia válidas. Las normas permiten la expresión de las conjunciones y disyunciones puramente en términos de vía negación.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
\lnot ( p \land q ) &\equiv \lnot p \lor \lnot q & 
\lnot ( p \lor q ) &\equiv \lnot p \land \lnot q
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-orgd5a97ce" class="outline-2">
<h2 id="orgd5a97ce"><span class="section-number-2">18</span> Leyes de absorción</h2>
<div class="outline-text-2" id="text-18">
<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
p \lor (p \land q) &\equiv p & p \land (p \lor q) &\equiv p
\end{aligned} \]
</p>

</div>
</div>
</div>

<div id="outline-container-org35e54b0" class="outline-2">
<h2 id="org35e54b0"><span class="section-number-2">19</span> Negaciones de <b>t</b> y <b>c</b></h2>
<div class="outline-text-2" id="text-19">
<p>
El negativo de una tautología es una contradicción y el opuesto de una contradicción es una tautología.
</p>

<div class="DEMONSTRATION">
<p>
\[ \begin{aligned}
\lnot t &\equiv c & \lnot c &\equiv t
\end{aligned} \]
</p>

</div>
</div>
</div>
<div id="outline-container-org3f5979d" class="outline-2">
<h2 id="org3f5979d"><span class="section-number-2">20</span> Implicación</h2>
<div class="outline-text-2" id="text-20">
<p>
La implicación logica se emplea para representar una afirmacion no hipotetica, es decir: A es verdadero por lo tanto B es verdadero.
</p>

<div class="DEMONSTRATION">
<div class="org-center">
<p>

</p>

<p>
"Sí llueve, el suelo esta mojado" <br />
"llueve. por tanto, el suelo esta mojado"<br />
</p>
</div>

</div>
</div>
</div>

<div id="outline-container-org4022081" class="outline-2">
<h2 id="org4022081"><span class="section-number-2">21</span> Validación de argumentos (Demostración)</h2>
<div class="outline-text-2" id="text-21">
<p>
Un argumento es valido (lógico) sí la conclusion  es verdadera siempre y cuando todas las premisas sean verdaderas
</p>

<div class="DEMONSTRATION">
<p>
Un argumento valido seria algo como: <br />
</p>

<p>
\[ ((\lnot p \implies q) \land (p \implies (\lnot r \lor s))) \implies ( \lnot s \land \lnot q \land \lnot r ) \implies p\]
</p>

</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Nota al pie de p&aacute;gina: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Una forma para identificar cual simbolo es "y" es recordar que ambas tienen forma de "v", osea ambas apuntan hacia abajo.
</p></div></div>


</div>
</div></div>
</body>
</html>
